Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON LATAM_Secretary Out-of-Order.tmx
Source language: en
Languages: es_419

source: dohyeok might be a bit stubborn, but he's charming in his own way. please take care of him.
es_419: Dohyeok es un poco terco, sí, pero es encantador a su modo. Cuídalo, por favor.

source: You have a reputation to uphold.
es_419: Tiene una reputación que mantener.

source: great timing.
es_419: Justo a tiempo.

source: That's probably why I did that while I was drunk.
es_419: Quizás por eso lo hice estando ebria.

source: w-what?!
es_419: ¡¿Quééé?!

source: no, you can't!
es_419: ¡No, no puedes!

source: but,
es_419: Pero…

source: I'll skip the points.
es_419: No sumaré puntos.

source: or is he coming back?
es_419: ¿O va a volver?

source: stroke
es_419: ACARICIA

source: tip toe
es_419: de puntillas

source: this is secretary jiyun lee.
es_419: Soy la secretaria Jiyun Lee.

source: a rabbit.
es_419: Un conejo.

source: shrug
es_419: se encoge

source: I can finish up the rest.
es_419: Yo termino el resto.

source: remaining sum
es_419: saldo

source: oh, he looks so tired!
es_419: Uy, ¡está muy cansado!

source: ugh, this is so embarrassing.
es_419: Uff, qué vergüenza.

source: duel accepted!
es_419: ¡Acepto el desafío!

source: i-it's nicer than the office.
es_419: E-es mejor que la oficina.

source: perhaps that was why I could keep up with you although you worked like crazy.
es_419: Quizás por eso pude mantenerle el ritmo, aunque me rompiera el lomo trabajando.

source: scurry
es_419: apurada

source: In the craze of it all, I brought my work with me.
es_419: Con toda la conmoción, me traje un papel de trabajo.

source: wow. even rich people like him have chicken and beer by the han river.
es_419: Guau. Hasta la gente rica como él come pollo y bebe cerveza junto al río Han.

source: you're right. he's making all that effort for his child but treats you like trash?!
es_419: Tienes razón. ¿Se esfuerza tanto por su hijo, pero a ti te trata como basura?

source: 1. calling him mr. choi instead of mr. chae.
es_419: 1. Decirle señor Choi en vez de señor Chae.

source: right now...
es_419: Ahora…

source: ...that means he has a wife, too.
es_419: … significa que también está casado.

source: gimbap sandwich
es_419: GIMBAP SÁNDWICHES

source: - episode 13 -
es_419: - episodio 13 -

source: I don't get it. what's happening?
es_419: No entiendo. ¿Qué está pasando?

source: mbti isfj's courage level at 100%
es_419: Personalidad defensora. Coraje al 100 %

source: at least not for that jerk!
es_419: ¡Al menos, no para ese idiota!

source: hey…
es_419: Oye…

source: ...on?
es_419: … pasando?

source: it reminds me of the old times.
es_419: Me recuerda a los viejos tiempos.

source: wait
es_419: ganas

source: yesterday's revenge plot...
es_419: El plan vengativo de ayer…

source: it was stressful even just having it in the house.
es_419: Me estresaba de solo tenerla en casa.

source: I wanted to know… to be honest.
es_419: La verdad… quería saberlo.

source: I wasn't uncomfortable at all.
es_419: No me incomodó para nada.

source: mr. chae is not just any boss.
es_419: Él no es un jefe cualquiera.

source: I know it would've happened eventually,
es_419: Sé que habría pasado en algún momento,

source: what this time?!
es_419: ¡¿Qué pasa ahora?!

source: ...if she remembers the same things I do...
es_419: … si recuerda lo mismo que yo…

source: cycle along han river
es_419: Bici junto al río Han

source: He's totally different now.
es_419: Está totalmente cambiado.

source: TSK TSK
es_419: TCH TCH

source: screech
es_419: ñiiii

source: sir, mr. chae.
es_419: Oye, señor Chae.

source: anyway, my mom…
es_419: Como sea, mi mamá…

source: after paying all your debts!
es_419: ¡Luego de pagar todas sus deudas!

source: I can talk to HR about keeping all the doors open.
es_419: Puedo ver algunas opciones con recursos humanos.

source: there were plenty of taxis when I looked earlier.
es_419: Cuando me fijé antes, había muchos taxis libres.

source: I said to stop watching dramas!
es_419: ¡Te dije que no vieras más novelas!

source: y-yikes!
es_419: ¡Guaaau!

source: ...but we need to get to work.
es_419: … pero debemos ir a trabajar.

source: even if it's not at iren.
es_419: Aunque no fuera en IREN.

source: ...are you being like this now?
es_419: … se porta así ahora?

source: how did I have the guts to hand in my resignation the first time?!
es_419: ¡¿Cómo tuve el coraje de presentar mi renuncia la primera vez?!

source: noooooo!
es_419: ¡Nooo!

source: I'm sure you'll do great, whatever you do.
es_419: Seguro te irá muy bien, hagas lo que hagas.

source: but of all men, why dohyeok?
es_419: Pero de tantos, ¿justo Dohyeok?

source: don't tell me you won the lottery! haha.
es_419: ¡No me digas que ganaste la lotería! Ja, ja.

source: I personally think we should do our best at the jobs we have now...
es_419: Personalmente, creo que debemos hacer lo mejor posible en nuestro empleo…

source: I’m doomed!
es_419: ¡Estoy frita!

source: *about $10 USD.
es_419: * MÁS O MENOS USD 10.

source: it's always the quiet ones that cause trouble! what's wrong with you?! just come.
es_419: ¡Las más tranquilas son las que causan más problemas! ¡¿Qué te pasa?! Ven aquí.

source: her name is jiwoo lee.
es_419: Se llama Jiwoo Lee.

source: no. I've always wanted to shop like this.
es_419: Mm. Siempre quise comprar cosas como estas.

source: nice to meet you!
es_419: ¡Gusto en conocerte!

source: and I never hung out with people at the office unless I had to for work.
es_419: Y en la oficina nunca me acerqué a otras personas, salvo por trabajo.

source: hey! mr. dohyeok chae!
es_419: ¡Ey, señor Dohyeok Chae!

source: tardiness
es_419: Llegar tarde

source: But I can't remember her last name. it was fancy…
es_419: Pero no recuerdo el apellido. Era llamativo…

source: hyorin, I'm glad to see you...
es_419: Hyorin, me alegro de verte…

source: huh? baby? whose baby?
es_419: ¿Eh? ¿Bebé? ¿Qué bebé?

source: everyone makes mistakes.
es_419: Cualquiera se equivoca.

source: but for a bunch of reasons...
es_419: pero, por varios motivos…

source: ...or was it, iren's work of art?
es_419: … ¿o era la obra de arte?

source: I can't believe you're in my arms, ms. gam.
es_419: Es increíble que te esté abrazando, señorita Gam.

source: really? go on, in what way?
es_419: Ah, ¿sí? Dime más, ¿cómo?

source: I can't focus on my work as I used to, either.
es_419: Tampoco me puedo concentrar en el trabajo como antes.

source: shall we get some fresh air?
es_419: ¿Vamos a tomar aire fresco?

source: how about...
es_419: ¿Qué tal…

source: vrrrr
es_419: TRRR

source: when I first met ms. gam...
es_419: Cuando conocí a la señorita Gam…

source: chosen by 294738 men in 2021! the best cosmetic of 2021
es_419: ¡Elegido por 294738 hombres en 2021! Mejor cosmética de 2021

source: one vehicle was damaged.
es_419: Un vehículo sufrió daños.

source: isn't it awesome?
es_419: ¿No es fantástico?

source: wham
es_419: PUMBA

source: ...right?
es_419: … ¿verdad?

source: all you ever call me is ms. gam.
es_419: Te la pasas diciéndome señorita Gam.

source: top-notch work ethic...
es_419: Ética laboral de primera…

source: That's going to be difficult.
es_419: Va a estar difícil.

source: w-who…
es_419: ¿Q-quién…?

source: is there something wrong, miss?
es_419: ¿Hay algún problema, señorita?

source: ms. gam…
es_419: La señorita Gam…

source: I'll fix her back to the way she was.
es_419: La voy a encarrilar, será como antes.

source: that's strange.
es_419: Qué raro.

source: seogyeong was right.
es_419: Seogyeong tenía razón.

source: thank you, ms. gam.
es_419: Gracias, señorita Gam.

source: can't
es_419: muere de

source: something that's hard to do as grown- ups.
es_419: Cuesta hacerlo entre adultos.

source: letter of resignation
es_419: Carta de renuncia

source: age of AI war / job
es_419: Guerra/empleo en IA

source: no, I can do this.
es_419: No, yo puedo con esto.

source: I finally said it.
es_419: Al fin lo dije.

source: what were you doing?
es_419: ¿Qué estabas haciendo?

source: I think she's out-of-order.
es_419: Creo que está descarriada.

source: 1 chapter
es_419: CAPÍTULO 1

source: his role is to bring out the best in them.
es_419: Su función es aprovechar ese potencial.

source: then it's not big deal...
es_419: Entonces no es para tanto…

source: most of them can't return to work once they leave.
es_419: La mayoría no puede volver a trabajar.

source: I don't want to be trampled on anymore, mr. chae.
es_419: No quiero que me pisoteen más, señor Chae.

source: S L U R P
es_419: S O R B E

source: ...yet he's already showing his true colors.
es_419: … pero ya se le está cayendo la máscara.

source: I'd like to know why he was like that then and why he's being the way he is now.
es_419: Me gustaría saber por qué era así antes, y por qué cambió sus modos.

source: it's just a hairline fracture. there's no need to worry.
es_419: Es una fisura, nada más. Nada de qué preocuparse.

source: m-me?
es_419: ¿Yo?…

source: is it because of your girlfriend?
es_419: ¿Es por tu novia?

source: I'm fine with anything.
es_419: Cualquier plato está bien.

source: I'll get going now.
es_419: Bueno, me voy.

source: you thought we were going out?
es_419: ¿Creíste que éramos novios?

source: calm down.
es_419: Cálmate.

source: or grad school?
es_419: ¿O harás un posgrado?

source: so I didn't want to lose you...
es_419: Así que no quiero perderte…

source: is that a compliment?
es_419: ¿Es un halago?

source: well, it just happened.
es_419: Pues, se dio así.

source: (watching for his reaction)
es_419: (espera su reacción)

source: No, I'm fine.
es_419: No, estoy bien.

source: is this why he's called me out tonight?
es_419: ¿Para esto me invitó a salir hoy?

source: mr. chae, I'll have it ready for you to review later once you're better!
es_419: Señor Chae, ¡lo prepararé para que lo pueda revisar cuando se mejore!

source: employ of iren y***** sales specialist december 11
es_419: trabajó en IREN / y***** / especialista en ventas / 11 de diciembre

source: you know,
es_419: ¿Sabes qué?

source: what about you, mr. gam? can you drink?
es_419: ¿Y tú, señorita Gam? ¿Bebes mucho?

source: you and mr. chae comes from completely different worlds.
es_419: El señor Chae y tú son de mundos totalmente distintos.

source: now that's an elaborate passive-aggressive move. is that a CEO level skill?
es_419: Pero es una maniobra pasivo-agresiva compleja. ¿Será porque es CEO?

source: a true ceo would never discard his employee.
es_419: Un CEO de verdad no descartaría a su empleada.

source: I've never seen anyone train their successor this thoroughly before.
es_419: Nunca vi a nadie capacitar a sus sucesoras con tanto esmero.

source: huh? w-well...
es_419: ¿Eh? Ehm…

source: wink
es_419: GUIÑO

source: "chapter two,
es_419: "Capítulo dos:

source: so that you can piss him off more.
es_419: Así, se va a enojar mucho más.

source: GROAN
es_419: OUUU

source: ...my mind has been filled with you lately, ms. gam.
es_419: … últimamente estoy pensando mucho en ti, señorita Gam.

source: that just makes it seem like it doesn't matter who I'm marrying as long as I'm married.
es_419: Así, parece como si no importara con quién me caso, siempre y cuando me case.

source: for everything that I did that made you uncomfortable.
es_419: Todo lo que he hecho que te hizo sentir incómoda.

source: I think I'll go buy some hangover medicine.
es_419: Creo que iré a comprar algo para la resaca.

source: PERFECT!
es_419: ¡PERFECTO!

source: ...I bought lottery tickets in a fit of anger...
es_419: … compré billetes de lotería en un arranque de furia…

source: maybe she got into an accident?
es_419: ¿Habrá tenido un accidente?

source: ask dohyeok what's going on. rock, paper, scissors!
es_419: Preguntarle a Dohyeok qué pasa. ¡Piedra, papel o tijera!

source: because I won the lottery.
es_419: Porque gané la lotería.

source: yay!
es_419: ¡Iupi!

source: I'm good looking?
es_419: ¿Soy apuesto?

source: mr. choi, you must be starving! please, enjoy your meal!
es_419: ¡Seguro tiene mucha hambre, señor Choi! ¡Buen provecho!

source: let's now go to the fruit section.
es_419: Ahora, a la sección de frutas.
